{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "business/economy: trade, inflation, entrepreneur, bank, vat tax, remittance, budget, stock exchange, export-import, unemployment",
    "1": "politics - student: chhatrodol, chhatroleague, shibir",
    "2": "politics - international",
    "3": "crime/cybercrime: kishor gang, suicide, eve-teasing, drugs, hijacking, harassment, hack",
    "4": "development/projects: mega projects, padma bridge, metro rail, disaster relief, charity",
    "5": "education",
    "6": "science/technology",
    "7": "entertainment",
    "8": "health",
    "9": "sports",
    "10": "accident",
    "11": "political parties: gono adhikar parishad, bnp, awami league, jamaat",
    "12": "religion",
    "13": "politics - national",
    "14": "election",
    "15": "corruption"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "accident": 10,
    "business/economy: trade, inflation, entrepreneur, bank, vat tax, remittance, budget, stock exchange, export-import, unemployment": 0,
    "corruption": 15,
    "crime/cybercrime: kishor gang, suicide, eve-teasing, drugs, hijacking, harassment, hack": 3,
    "development/projects: mega projects, padma bridge, metro rail, disaster relief, charity": 4,
    "education": 5,
    "election": 14,
    "entertainment": 7,
    "health": 8,
    "political parties: gono adhikar parishad, bnp, awami league, jamaat": 11,
    "politics - international": 2,
    "politics - national": 13,
    "politics - student: chhatrodol, chhatroleague, shibir": 1,
    "religion": 12,
    "science/technology": 6,
    "sports": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.21.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
